esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHE</name>
      <description>CACHE Peripheral</description>
      <groupName>CACHE</groupName>
      <baseAddress>0x600c8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3f4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CACHE</name>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>L1_ICACHE_CTRL</name>
          <description>L1 instruction Cache(L1-ICache) control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE_SHUT_IBUS0</name>
              <description>The bit is used to disable core0 ibus access L1-ICache, 0: enable, 1: disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE_SHUT_IBUS1</name>
              <description>The bit is used to disable core1 ibus access L1-ICache, 0: enable, 1: disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE_SHUT_IBUS2</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE_SHUT_IBUS3</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE_UNDEF_OP</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_CTRL</name>
          <description>L1 data cache (L1 cache) control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_SHUT_BUS0</name>
              <description>Configures whether to disable BUS0 to access the L1 cache.\\
0: Enable\\
1: Disable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_SHUT_BUS1</name>
              <description>Configures whether to disable BUS1 to access the L1 cache.\\
0: Enable\\
1: Disable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_SHUT_BUS2</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_SHUT_BUS3</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_SHUT_DMA</name>
              <description>The bit is used to disable DMA access L1-Cache, 0: enable, 1: disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_UNDEF_OP</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BYPASS_CACHE_CONF</name>
          <description>Bypass Cache configure register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BYPASS_L1_ICACHE0_EN</name>
              <description>The bit is used to enable bypass L1-ICache0. 0: disable bypass, 1: enable bypass.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_L1_ICACHE1_EN</name>
              <description>The bit is used to enable bypass L1-ICache1. 0: disable bypass, 1: enable bypass.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_L1_ICACHE2_EN</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_L1_ICACHE3_EN</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_L1_CACHE_EN</name>
              <description>The bit is used to enable bypass L1-Cache. 0: disable bypass, 1: enable bypass.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ATOMIC_CONF</name>
          <description>L1 Cache atomic feature configure register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>L1_CACHE_ATOMIC_EN</name>
              <description>The bit is used to enable atomic feature on L1-Cache when multiple cores access L1-Cache.  1: disable, 1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ACACHE_CACHESIZE_CONF</name>
          <description>L1 Auxiliary Cache CacheSize mode configure register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>L1_ACACHE_CACHESIZE_256</name>
              <description>The field is used to configure cachesize of L1-ACache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_512</name>
              <description>The field is used to configure cachesize of L1-ACache as 512 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_1K</name>
              <description>The field is used to configure cachesize of L1-ACache as 1k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_2K</name>
              <description>The field is used to configure cachesize of L1-ACache as 2k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_4K</name>
              <description>The field is used to configure cachesize of L1-ACache as 4k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_8K</name>
              <description>The field is used to configure cachesize of L1-ACache as 8k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_16K</name>
              <description>The field is used to configure cachesize of L1-ACache as 16k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_32K</name>
              <description>The field is used to configure cachesize of L1-ACache as 32k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_64K</name>
              <description>The field is used to configure cachesize of L1-ACache as 64k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_128K</name>
              <description>The field is used to configure cachesize of L1-ACache as 128k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_256K</name>
              <description>The field is used to configure cachesize of L1-ACache as 256k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_512K</name>
              <description>The field is used to configure cachesize of L1-ACache as 512k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_CACHESIZE_1024K</name>
              <description>The field is used to configure cachesize of L1-ACache as 1024k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ACACHE_BLOCKSIZE_CONF</name>
          <description>L1 Auxiliary Cache BlockSize mode configure register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_8</name>
              <description>The field is used to configureblocksize of L1-ACache as 8 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_16</name>
              <description>The field is used to configureblocksize of L1-ACache as 16 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_32</name>
              <description>The field is used to configureblocksize of L1-ACache as 32 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_64</name>
              <description>The field is used to configureblocksize of L1-ACache as 64 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_128</name>
              <description>The field is used to configureblocksize of L1-ACache as 128 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ACACHE_BLOCKSIZE_256</name>
              <description>The field is used to configureblocksize of L1-ACache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE_CACHESIZE_CONF</name>
          <description>L1 instruction Cache CacheSize mode configure register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE_CACHESIZE_256</name>
              <description>The field is used to configure cachesize of L1-ICache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_512</name>
              <description>The field is used to configure cachesize of L1-ICache as 512 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_1K</name>
              <description>The field is used to configure cachesize of L1-ICache as 1k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_2K</name>
              <description>The field is used to configure cachesize of L1-ICache as 2k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_4K</name>
              <description>The field is used to configure cachesize of L1-ICache as 4k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_8K</name>
              <description>The field is used to configure cachesize of L1-ICache as 8k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_16K</name>
              <description>The field is used to configure cachesize of L1-ICache as 16k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_32K</name>
              <description>The field is used to configure cachesize of L1-ICache as 32k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_64K</name>
              <description>The field is used to configure cachesize of L1-ICache as 64k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_128K</name>
              <description>The field is used to configure cachesize of L1-ICache as 128k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_256K</name>
              <description>The field is used to configure cachesize of L1-ICache as 256k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_512K</name>
              <description>The field is used to configure cachesize of L1-ICache as 512k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_CACHESIZE_1024K</name>
              <description>The field is used to configure cachesize of L1-ICache as 1024k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE_BLOCKSIZE_CONF</name>
          <description>L1 instruction Cache BlockSize mode configure register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_8</name>
              <description>The field is used to configureblocksize of L1-ICache as 8 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_16</name>
              <description>The field is used to configureblocksize of L1-ICache as 16 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_32</name>
              <description>The field is used to configureblocksize of L1-ICache as 32 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_64</name>
              <description>The field is used to configureblocksize of L1-ICache as 64 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_128</name>
              <description>The field is used to configureblocksize of L1-ICache as 128 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE_BLOCKSIZE_256</name>
              <description>The field is used to configureblocksize of L1-ICache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
