esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SYNC_CTRL</name>
          <description>Sync operation control register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>INVALIDATE_ENA</name>
              <description>Configures whether to enable the invalidatation operation. It will be cleared by hardware after the operation is done.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLEAN_ENA</name>
              <description>The bit is used to enable clean operation. It will be cleared by hardware after clean operation done. Note that this bit and the other sync-bits (invalidate_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_ENA</name>
              <description>The bit is used to enable writeback operation. It will be cleared by hardware after writeback operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_INVALIDATE_ENA</name>
              <description>The bit is used to enable writeback-invalidate operation. It will be cleared by hardware after writeback-invalidate operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_DONE</name>
              <description>Represents whether the synchronization operation is finished.\\
0: Not finished\\
1: Finished\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC_RGID</name>
              <description>The bit is used to set  the gid of cache sync operation (invalidate, clean, writeback, writeback_invalidate)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_MAP</name>
          <description>Sync map configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>SYNC_MAP</name>
              <description>Configures which caches in the two-level cache structure will apply the sync operation. \\
Bit 4: Write 1 to this bit to select the L1 cache\\
Other bits: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_ADDR</name>
          <description>Sync address configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC_ADDR</name>
              <description>Configures the starting virtual address for the synchronization operation. This field should be configured together with CACHE_SYNC_SIZE_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_SIZE</name>
          <description>Sync size configuration register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC_SIZE</name>
              <description>Configures the size for the synchronization operation. This field should be configured together with CACHE_SYNC_ADDR_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 0 preload-operation control register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache0. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache0 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 0 preload address configure register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 0 preload size configure register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 1 preload-operation control register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache1. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache1 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 1 preload address configure register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 1 preload size configure register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 2 preload-operation control register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache2. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache2 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 2 preload address configure register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 2 preload size configure register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 3 preload-operation control register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache3. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache3 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 3 preload address configure register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 3 preload size configure register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_PRELOAD_CTRL</name>
          <description>L1 cache preloading operation control register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_CACHE_PRELOAD_ENA</name>
              <description>Configures whether to enable the preloading operation in the L1 cache. It will be cleared by hardware automatically after the preloading operation is done.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PRELOAD_DONE</name>
              <description>Represents whether the preloading operation is finished.\\
0: Not finished\\
1: Finished\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_PRELOAD_ORDER</name>
              <description>Configures the direction of the preloading operation.\\
0: Ascending\\
1: Descending\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 Cache preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_PRELOAD_ADDR</name>
          <description>L1 cache preloading address configuration register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_PRELOAD_ADDR</name>
              <description>Configures the starting virtual address for the preloading operation in the L1 cache. This field should be configured together with CACHE_L1_CACHE_PRELOAD_SIZE_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_PRELOAD_SIZE</name>
          <description>L1 cache preloading size configuration register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_PRELOAD_SIZE</name>
              <description>Configures the size of Section 0 for the preloading operation in the L1 cache. This field should be configured together with CACHE_L1_CACHE_PRELOAD_ADDR_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_CTRL</name>
          <description>L1 instruction Cache 0 autoload-operation control register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on L1-ICache0.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L1-ICache0 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on L1-ICache0. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L1-ICache0. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on L1-ICache0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on L1-ICache0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache0 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_AUTOLOAD_SCT0_ADDR</name>
          <description>L1 instruction Cache 0 autoload section 0 address configure register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section for autoload operation on L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_SIZE and L1_ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
