esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_RAW</name>
          <description>Cache access failed interrupt raw register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L1-ICache3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_FAIL_INT_RAW</name>
              <description>The raw interrupt status of L1_CACHE_FAIL_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_INT_ST</name>
          <description>Cache access failed interrupt status register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L1-ICache0 due to cpu accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L1-ICache1 due to cpu accesses L1-ICache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_FAIL_INT_ST</name>
              <description>The masked interrupt status of L1_CACHE_FAIL_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_CNT_CTRL</name>
          <description>Cache access counter enable and clear register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_CNT_ENA</name>
              <description>The bit is used to enable ibus0 counter in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_ENA</name>
              <description>The bit is used to enable ibus1 counter in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_BUS0_CNT_ENA</name>
              <description>Configures whether to enable the BUS0 counters in the L1 cache.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_BUS1_CNT_ENA</name>
              <description>Configures whether to enable the BUS1 counters in the L1 cache.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_BUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_BUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS0_CNT_CLR</name>
              <description>The bit is used to clear ibus0 counter in L1-ICache0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_CLR</name>
              <description>The bit is used to clear ibus1 counter in L1-ICache1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_BUS0_CNT_CLR</name>
              <description>Configures whether to clear the BUS0 counters in the L1 cache. \\
0: Not clear\\
1: Clear\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_BUS1_CNT_CLR</name>
              <description>Configures whether to clear the BUS1 counters in the L1 cache.\\
0: Not clear\\
1: Clear\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_BUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_BUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_HIT_CNT</name>
          <description>L1-ICache bus0 Hit-Access Counter register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_MISS_CNT</name>
          <description>L1-ICache bus0 Miss-Access Counter register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_MISS_CNT</name>
              <description>The register records the number of missing when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_HIT_CNT</name>
          <description>L1-ICache bus1 Hit-Access Counter register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_MISS_CNT</name>
          <description>L1-ICache bus1 Miss-Access Counter register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_HIT_CNT</name>
          <description>L1-ICache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_MISS_CNT</name>
          <description>L1-ICache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_HIT_CNT</name>
          <description>L1-ICache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_MISS_CNT</name>
          <description>L1-ICache bus3 Miss-Access Counter register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS0_ACS_HIT_CNT</name>
          <description>L1 cache BUS1 hit-access counter register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS0_HIT_CNT</name>
              <description>Represents the number of hits when BUS0 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS0_ACS_MISS_CNT</name>
          <description>L1 cache BUS0 missed-access counter register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS0_MISS_CNT</name>
              <description>Represents the number of misses when BUS0 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS0_ACS_CONFLICT_CNT</name>
          <description>L1 cache BUS0 conflicting-access counter register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS0_CONFLICT_CNT</name>
              <description>Represents the number of access conflicts when BUS0 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1 cache BUS0 next-level-access counter register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS0_NXTLVL_RD_CNT</name>
              <description>Represents the number of times the L1 cache accesses the next-level module due to BUS0 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L1-Cache bus0 WB-Access Counter register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS1_ACS_HIT_CNT</name>
          <description>L1 cache BUS1 hit-access counter register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS1_HIT_CNT</name>
              <description>Represents the number of hits when BUS1 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS1_ACS_MISS_CNT</name>
          <description>L1 cache BUS1 missed-access counter register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS1_MISS_CNT</name>
              <description>Represents the number of misses when BUS1 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS1_ACS_CONFLICT_CNT</name>
          <description>L1 cache BUS1 conflicting-access counter register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS1_CONFLICT_CNT</name>
              <description>Represents the number of access conflicts when BUS1 accesses the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1 cache BUS1 next-level-access counter register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS1_NXTLVL_RD_CNT</name>
              <description>Indicates the number of times the L1 cache accesses the next-level module due to BUS1 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
