esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>L1_BUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L1-Cache bus1 WB-Access Counter register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus1 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS2_ACS_HIT_CNT</name>
          <description>L1-Cache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS2_ACS_MISS_CNT</name>
          <description>L1-Cache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS2_ACS_CONFLICT_CNT</name>
          <description>L1-Cache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-Cache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus2 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS2_ACS_NXTLVL_WR_CNT</name>
          <description>L1-Cache bus2 WB-Access Counter register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS2_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus2 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS3_ACS_HIT_CNT</name>
          <description>L1-Cache bus3 Hit-Access Counter register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS3_ACS_MISS_CNT</name>
          <description>L1-Cache bus3 Miss-Access Counter register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS3_ACS_CONFLICT_CNT</name>
          <description>L1-Cache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-Cache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-Cache accesses L2-Cache due to bus3 accessing L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_BUS3_ACS_NXTLVL_WR_CNT</name>
          <description>L1-Cache bus3 WB-Access Counter register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_BUS3_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_ID_ATTR</name>
          <description>L1-Cache Access Fail ID/attribution information register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_FAIL_ID</name>
              <description>Represents the ID of the failed access to the L1 cache.\\
Bit 4: BUS0\\
Bit 5: BUS1\\
Others: reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_FAIL_ATTR</name>
              <description>Represents the attribute of the failed access to the L1 cache.\\
Bit 0: Fetching instructions\\
Bit 1: Reading data\\
Bit 7: non-cacheable\\
Others: reserved\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_ACS_FAIL_ADDR</name>
          <description>L1 cache access failed address information register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_CACHE_FAIL_ADDR</name>
              <description>Represents the address of the failed access to the L1 cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_SYNC_PRELOAD_INT_ENA</name>
          <description>Sync and preloading operation interrupt enable register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache0 preload-operation. If preload operation is done, interrupt occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache1 preload-operation. If preload operation is done, interrupt occurs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_DONE_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_DONE_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_DONE_INT_ENA</name>
              <description>Write 1 to enable L1_CACHE_PLD_DONE_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_DONE_INT_ENA</name>
              <description>Write 1 to enable CACHE_SYNC_DONE_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache0 preload-operation error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache1 preload-operation error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_ERR_INT_ENA</name>
              <description>Write 1 to enable CACHE_PLD_ERR_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_ERR_INT_ENA</name>
              <description>Write 1 to enable CACHE_SYNC_ERR_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_SYNC_PRELOAD_INT_CLR</name>
          <description>Sync and preloading operation interrupt clear register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_DONE_INT_CLR</name>
              <description>The bit is used to clear interrupt that occurs only when L1-ICache0 preload-operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_DONE_INT_CLR</name>
              <description>The bit is used to clear interrupt that occurs only when L1-ICache1 preload-operation is done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_DONE_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_DONE_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_DONE_INT_CLR</name>
              <description>Write 1 to clear L1_CACHE_PLD_DONE_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYNC_DONE_INT_CLR</name>
              <description>Write 1 to clear CACHE_SYNC_DONE_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PLD_ERR_INT_CLR</name>
              <description>The bit is used to clear interrupt of L1-ICache0 preload-operation error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_INT_CLR</name>
              <description>The bit is used to clear interrupt of L1-ICache1 preload-operation error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_ERR_INT_CLR</name>
              <description>Write 1 to clear L1_CACHE_PLD_ERR_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYNC_ERR_INT_CLR</name>
              <description>Write 1 to clear CACHE_SYNC_ERR_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
