esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ECDSA</name>
      <description>ECDSA (Elliptic Curve Digital Signature Algorithm) Accelerator</description>
      <groupName>ECDSA</groupName>
      <baseAddress>0x6008e000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xf8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ECDSA</name>
        <value>64</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF</name>
          <description>ECDSA configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WORK_MODE</name>
              <description>Configures the working mode of ECDSA accelerator. \\
0: Signature Verification Mode\\
1: Signature Generation Mode\\
2: Public Key Export Mode\\
3: Invalid\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_CURVE</name>
              <description>Configures the elliptic curve used.\\
0: P-192\\
1: P-256\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_K</name>
              <description>Configures the generation source of k.\\
0: k is automatically generated by hardware\\
1: k is written by software\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_Z</name>
              <description>Configures how the parameter 4$ is set. \\
0: Generated from SHA result\\
1: Written by software\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DETERMINISTIC_K</name>
              <description>Configures how the parameter 5$ is set. \\
0: Automatically generated by TRNG\\
1: Generated by the deterministic derivation algorithm\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>ECDSA clock gate register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GATE_FORCE_ON</name>
              <description>Configures whether to force on ECDSA memory clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>ECDSA interrupt raw register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_RAW</name>
              <description>The raw interrupt status of the ECDSA_PREP_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_RAW</name>
              <description>The raw interrupt status of the ECDSA_PROC_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_RAW</name>
              <description>The raw interrupt status of the ECDSA_POST_DONE_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_RAW</name>
              <description>The raw interrupt status of the ECDSA_SHA_RELEASE_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>ECDSA interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ST</name>
              <description>The masked interrupt status of the ECDSA_PREP_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ST</name>
              <description>The masked interrupt status of the ECDSA_PROC_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_ST</name>
              <description>The masked interrupt status of the ECDSA_POST_DONE_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_ST</name>
              <description>The masked interrupt status of the ECDSA_SHA_RELEASE_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>ECDSA interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ENA</name>
              <description>Write 1 to enable the ECDSA_PREP_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ENA</name>
              <description>Write 1 to enable the ECDSA_PROC_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DONE_INT_ENA</name>
              <description>Write 1 to enable the ECDSA_POST_DONE_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_ENA</name>
              <description>Write 1 to enable the ECDSA_SHA_RELEASE_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>ECDSA interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_CLR</name>
              <description>Write 1 to clear the ECDSA_PREP_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_CLR</name>
              <description>Write 1 to clear the ECDSA_PROC_DONE_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_CLR</name>
              <description>Write 1 to clear the ECDSA_POST_DONE_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHA_RELEASE_INT_CLR</name>
              <description>Write 1 to clear the ECDSA_SHA_RELEASE_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>ECDSA start register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Configures whether to start the ECDSA operation. This bit will be self-cleared after configuration. \\
0: No effect\\
1: Start the ECDSA operation\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOAD_DONE</name>
              <description>Write 1 to generate a signal indicating the ECDSA accelerator's LOAD operation is done. This bit will be self-cleared after configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GET_DONE</name>
              <description>Write 1 to generate a signal indicating the ECDSA accelerator's GAIN operation is done. This bit will be self-cleared after configuration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>ECDSA status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Represents the working status of the ECDSA accelerator.\\
0: IDLE\\
1: LOAD\\
2: GAIN\\
3: BUSY\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>ECDSA result register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OPERATION_RESULT</name>
              <description>Indicates if the ECDSA operation is successful.\\
0: Not successful\\
1: Successful\\
Only valid when the ECDSA operation is done. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2403120</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>The ECDSA version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_MODE</name>
          <description>ECDSA SHA-control register (Hash algrithm)</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_MODE</name>
              <description>Configures SHA algorithms for message hash. \\
1: SHA-224\\
2: SHA-256\\
Others: invalid\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_START</name>
          <description>ECDSA SHA-control register (operation)</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_START</name>
              <description>Write 1 to start the first SHA operation in the ECDSA process. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONTINUE</name>
          <description>ECDSA SHA-control register (operation)</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_CONTINUE</name>
              <description>Write 1 to start the latter SHA operation in the ECDSA process. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_BUSY</name>
          <description>ECDSA SHA-control status register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_BUSY</name>
              <description>Represents the working status of the SHA accelerator in the ECDSA process.\\
0: IDLE\\
1: BUSY\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MESSAGE_MEM[%s]</name>
          <description>The memory that stores message.</description>
          <addressOffset>0x280</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>R_MEM[%s]</name>
          <description>The memory that stores r.</description>
          <addressOffset>0x340</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>S_MEM[%s]</name>
          <description>The memory that stores s.</description>
          <addressOffset>0x360</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>The memory that stores software written z.</description>
          <addressOffset>0x380</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>QAX_MEM[%s]</name>
          <description>The memory that stores x coordinates of QA or software written k.</description>
          <addressOffset>0x3a0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>QAY_MEM[%s]</name>
          <description>The memory that stores y coordinates of QA.</description>
          <addressOffset>0x3c0</addressOffset>
          <size>8</size>
        </register>
