esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>RD_REPEAT_DATA_ERR3</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS_DOWNLOAD_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_DOWNLOAD_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DIRECT_BOOT_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_DIRECT_BOOT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ROM_PRINT_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD_ERR</name>
              <description>Represents the programming error of EFUSE_ENABLE_SECURITY_DOWNLOAD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL_ERR</name>
              <description>Represents the programming error of EFUSE_UART_PRINT_CONTROL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME_ERR</name>
              <description>Represents the programming error of EFUSE_FORCE_SEND_RESUME</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_VERSION</description>
              <bitOffset>9</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_DISABLE_FAST_WAKE_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_DISABLE_FAST_WAKE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HYS_EN_PAD0_ERR</name>
              <description>Represents the programming error of EFUSE_HYS_EN_PAD0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR4</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HYS_EN_PAD1_ERR</name>
              <description>Represents the programming error of EFUSE_HYS_EN_PAD1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_LDO_POWER_SEL_ERR</name>
              <description>Represents the programming error of EFUSE_FLASH_LDO_POWER_SEL</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_RS_DATA_ERR0</name>
          <description>Represents rd_rs_data_err</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_MAC_SYS_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_mac_sys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_MAC_SYS_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_mac_sys is reliable\\ 1: Means that programming rd_mac_sys failed and the number of error bytes is over 6.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART1_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_sys_part1_data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART1_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_sys_part1_data is reliable\\ 1: Means that programming rd_sys_part1_data failed and the number of error bytes is over 6.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_USR_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_usr_data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_USR_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_usr_data is reliable\\ 1: Means that programming rd_usr_data failed and the number of error bytes is over 6.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY0_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key0_data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY0_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key0_data is reliable\\ 1: Means that programming rd_key0_data failed and the number of error bytes is over 6.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY1_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key1_data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY1_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key1_data is reliable\\ 1: Means that programming rd_key1_data failed and the number of error bytes is over 6.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY2_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key2_data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY2_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key2_data is reliable\\ 1: Means that programming rd_key2_data failed and the number of error bytes is over 6.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY3_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key3_data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY3_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key3_data is reliable\\ 1: Means that programming rd_key3_data failed and the number of error bytes is over 6.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY4_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key4_data</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY4_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key4_data is reliable\\ 1: Means that programming rd_key4_data failed and the number of error bytes is over 6.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_RS_DATA_ERR1</name>
          <description>Represents rd_rs_data_err</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_KEY5_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_key5_data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_KEY5_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_key5_data is reliable\\ 1: Means that programming rd_key5_data failed and the number of error bytes is over 6.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART2_DATA_ERR_NUM</name>
              <description>Represents the error number of registers.\\The value of this signal means the number of error bytes in rd_sys_part2_data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_SYS_PART2_DATA_FAIL</name>
              <description>Represents error status of register.\\0: Means no failure and that the data of rd_sys_part2_data is reliable\\ 1: Means that programming rd_sys_part2_data failed and the number of error bytes is over 6.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>eFuse version register.</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0x2410120</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Represents eFuse version. Date:2024-10-12 12:09:57, ScriptRev:892332a1019d3a17987b08c6835edce28f46e261</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>eFuse clcok configuration register.</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>MEM_FORCE_PD</name>
              <description>Configures whether to force power down eFuse SRAM.\\ 1: Force\\ 0: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_FORCE_ON</name>
              <description>Configures whether to force activate clock signal of eFuse SRAM.\\ 1: Force activate\\ 0: No effect\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PU</name>
              <description>Configures whether to force power up eFuse SRAM.\\ 1: Force\\ 0: No effect\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether to force enable eFuse register configuration clock signal.\\ 1: Force\\ 0: The clock is enabled only during the reading and writing of registers\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>eFuse operation mode configuraiton register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OP_CODE</name>
              <description>Configures operation command type.\\ 0x5A5A: Program operation command\\ 0x5AA5: Read operation command\\ Other values: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ECDSA_L_BLK</name>
              <description>Configures which block to use for ECDSA key low part output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ECDSA_H_BLK</name>
              <description>Configures which block to use for ECDSA key high part output.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>eFuse status register.</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Represents the state of the eFuse state machine.\\ 0: Reset state, the initial state after power-up\\ 1: Idle state\\ Other values: Non-idle state\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_LOAD_SW</name>
              <description>Represents the value of OTP_LOAD_SW.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_VDDQ_C_SYNC2</name>
              <description>Represents the value of OTP_VDDQ_C_SYNC2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_STROBE_SW</name>
              <description>Represents the value of OTP_STROBE_SW.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_CSB_SW</name>
              <description>Represents the value of OTP_CSB_SW.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_PGENB_SW</name>
              <description>Represents the value of OTP_PGENB_SW.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_VDDQ_IS_SW</name>
              <description>Represents the value of OTP_VDDQ_IS_SW.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLK0_VALID_BIT_CNT</name>
              <description>Represents the number of block valid bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ECDSA_L_BLK</name>
              <description>Represents which block is used for ECDSA key low part output.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ECDSA_H_BLK</name>
              <description>Represents which block is used for ECDSA key high part output.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>eFuse command register.</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_CMD</name>
              <description>Configures whether to send read commands.\\ 1: Send\\ 0: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM_CMD</name>
              <description>Configures whether to send programing commands.\\ 1: Send\\ 0: No effect\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLK_NUM</name>
              <description>Configures the serial number of the block to be programmed. Value 0-10 corresponds to block number 0-10, respectively.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>eFuse raw interrupt register.</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_RAW</name>
              <description>The raw interrupt status of EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_DONE_INT_RAW</name>
              <description>The raw interrupt status of EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>eFuse interrupt status register.</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_ST</name>
              <description>The masked interrupt status of EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_DONE_INT_ST</name>
              <description>The masked interrupt status of EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>eFuse interrupt enable register.</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_ENA</name>
              <description>Write 1 to enable EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM_DONE_INT_ENA</name>
              <description>Write 1 to enable EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
