esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>FUNC41_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC41_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC41_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG41_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC42_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC42_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC42_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG42_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC45_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>FUNC45_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC45_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG45_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC46_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>FUNC46_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC46_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG46_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC47_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC47_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC47_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG47_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC48_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC48_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC48_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG48_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC49_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC49_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC49_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG49_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC50_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC50_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC50_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG50_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC51_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC51_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC51_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG51_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC52_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC52_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC52_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG52_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC53_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC53_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC53_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG53_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC54_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC54_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC54_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG54_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC55_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>FUNC55_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC55_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG55_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC56_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>FUNC56_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC56_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG56_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC63_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC63_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC63_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG63_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC64_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC64_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC64_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG64_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC65_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC65_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC65_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG65_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC66_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC66_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC66_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG66_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
