esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>FUNC67_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC67_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC67_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG67_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC68_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC68_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC68_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG68_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC69_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC69_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC69_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG69_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC70_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC70_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC70_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG70_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC71_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC71_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC71_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG71_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC72_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC72_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC72_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG72_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC73_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>FUNC73_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC73_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG73_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC77_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC77_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC77_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG77_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC78_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC78_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC78_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG78_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC79_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC79_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC79_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG79_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC80_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC80_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC80_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG80_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC81_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC81_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC81_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG81_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC82_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC82_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC82_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG82_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC87_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC87_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC87_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG87_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC88_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC88_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC88_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG88_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC89_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC89_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC89_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG89_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC90_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC90_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC90_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG90_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC91_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC91_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC91_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG91_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
