esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>FUNC92_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC92_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC92_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG92_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC93_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC93_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC93_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG93_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC94_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x44c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC94_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC94_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG94_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC95_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC95_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC95_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG95_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC97_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC97_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC97_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG97_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC98_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x45c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC98_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC98_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG98_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC99_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC99_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC99_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG99_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC100_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC100_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC100_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG100_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC101_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC101_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC101_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG101_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC102_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x46c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC102_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC102_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG102_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC103_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC103_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC103_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG103_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC104_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC104_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC104_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG104_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC105_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC105_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC105_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG105_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC106_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x47c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC106_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC106_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG106_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC107_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC107_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC107_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG107_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC108_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC108_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC108_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG108_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC109_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC109_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC109_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG109_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC110_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x48c</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>FUNC110_IN_SEL</name>
              <description>set this value: s=0-29: connect GPIO[s] to this port. s=0x20: set this port always high level. s=0x30: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC110_IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG110_IN_SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
