esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_SD</name>
      <description>Sigma-Delta Modulation</description>
      <groupName>GPIOSD</groupName>
      <baseAddress>0x60091e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_EXT_CLOCK_GATE</name>
          <description>Clock Gating Configure Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_CLK_EN</name>
              <description>Clock enable bit of configuration registers for sigma delta modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_SIGMADELTA_MISC</name>
          <description>MISC Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_SIGMADELTA_CLK_EN</name>
              <description>Clock enable bit of sigma delta modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_SIGMADELTA%s</name>
          <description>Duty Cycle Configure Register of SDM%s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0xff00</resetValue>
          <fields>
            <field>
              <name>GPIO_EXT_SD_IN</name>
              <description>This field is used to configure the duty cycle of sigma delta modulation output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_SD_PRESCALE</name>
              <description>This field is used to set a divider value to divide APB clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_PAD_COMP_CONFIG_0</name>
          <description>PAD Compare configure Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_XPD_COMP_0</name>
              <description>Pad compare enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_MODE_COMP_0</name>
              <description>1 to enable external reference from PAD[x]. 0 to enable internal reference, meanwhile PAD[x] can be used as a regular GPIO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_DREF_COMP_0</name>
              <description>internal reference voltage tuning bit. 0V to 0.7*VDDPST step 0.1*VDDPST.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_PAD_COMP_FILTER_0</name>
          <description>Zero Detect filter Register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ZERO_DET_FILTER_CNT_0</name>
              <description>Zero Detect filter cycle length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_GLITCH_FILTER_CH%s</name>
          <description>Glitch Filter Configure Register of Channel%s</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_FILTER_CH0_EN</name>
              <description>Glitch Filter channel enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_INPUT_IO_NUM</name>
              <description>Glitch Filter input io number.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_WINDOW_THRES</name>
              <description>Glitch Filter window threshold.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_WINDOW_WIDTH</name>
              <description>Glitch Filter window width.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_ETM_EVENT_CH%s_CFG</name>
          <description>Etm Config register of Channel%s</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_CH0_EVENT_SEL</name>
              <description>Etm event channel select gpio.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_CH0_EVENT_EN</name>
              <description>Etm event send enable bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P0_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO0_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO0_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO1_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO1_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO2_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO2_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO3_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO3_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO4_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO4_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P1_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO5_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO5_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO6_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO6_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO7_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO7_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO8_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO8_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO9_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO9_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P2_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO10_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO10_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO11_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO11_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO12_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO12_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO13_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO13_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO14_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO14_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P3_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO15_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO15_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO16_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO16_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO17_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO17_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO18_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO18_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO19_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO19_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P4_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO20_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO20_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO21_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO21_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO22_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO22_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO23_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO23_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO24_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO24_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P5_CFG</name>
          <description>Etm Configure Register to decide which GPIO been chosen</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO25_SEL</name>
              <description>GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO25_EN</name>
              <description>Enable bit of GPIO response etm task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
