esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>GPIO_EXT_INT_RAW</name>
          <description>GPIO_EXT interrupt raw register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_COMP_NEG_0_INT_RAW</name>
              <description>analog comparator pos edge interrupt raw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_POS_0_INT_RAW</name>
              <description>analog comparator neg edge interrupt raw</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_ALL_0_INT_RAW</name>
              <description>analog comparator neg or pos edge interrupt raw</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_INT_ST</name>
          <description>GPIO_EXT interrupt masked register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_COMP_NEG_0_INT_ST</name>
              <description>analog comparator pos edge interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_POS_0_INT_ST</name>
              <description>analog comparator neg edge interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_ALL_0_INT_ST</name>
              <description>analog comparator neg or pos edge interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_INT_ENA</name>
          <description>GPIO_EXT interrupt enable register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>GPIO_EXT_COMP_NEG_0_INT_ENA</name>
              <description>analog comparator pos edge interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_POS_0_INT_ENA</name>
              <description>analog comparator neg edge interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_ALL_0_INT_ENA</name>
              <description>analog comparator neg or pos edge interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_INT_CLR</name>
          <description>GPIO_EXT interrupt clear register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_COMP_NEG_0_INT_CLR</name>
              <description>analog comparator pos edge interrupt clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_POS_0_INT_CLR</name>
              <description>analog comparator neg edge interrupt clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_EXT_COMP_ALL_0_INT_CLR</name>
              <description>analog comparator neg or pos edge interrupt clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_PIN_CTRL</name>
          <description>Clock Output Configuration Register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0x1def</resetValue>
          <fields>
            <field>
              <name>GPIO_EXT_CLK_OUT1</name>
              <description>If you want to output clock for I2S to CLK_OUT_out1, set this register to 0x0. CLK_OUT_out1 can be found in peripheral output signals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_CLK_OUT2</name>
              <description>If you want to output clock for I2S to CLK_OUT_out2, set this register to 0x0. CLK_OUT_out2 can be found in peripheral output signals.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_CLK_OUT3</name>
              <description>If you want to output clock for I2S to CLK_OUT_out3, set this register to 0x0. CLK_OUT_out3 can be found in peripheral output signals.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_VERSION</name>
          <description>Version Control Register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x2408150</resetValue>
          <fields>
            <field>
              <name>GPIO_EXT_DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
