esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>COMD0</name>
          <description>I2C command register 0</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND0</name>
              <description>Configures command 0. \\
It consists of three parts:\\ 
op_code is the command\\
0: RSTART\\ 
1: WRITE\\
2: READ\\
3: STOP\\
4: END.\\
Byte_num represents the number of bytes that need to be sent or received.\\
ack_check_en, ack_exp, and ack are used to control the ACK bit. See I2C cmd structure &lt;a href=fig:i2c-cmd-structure&quot;&gt;link&lt;/a&gt; for more information. \\&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND0_DONE</name>
              <description>Represents whether command 0 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD1</name>
          <description>I2C command register 1</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND1</name>
              <description>Configures command 1. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND1_DONE</name>
              <description>Represents whether command 1 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD2</name>
          <description>I2C command register 2</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND2</name>
              <description>Configures command 2. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND2_DONE</name>
              <description>Represents whether command 2 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD3</name>
          <description>I2C command register 3</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND3</name>
              <description>Configures command 3. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND3_DONE</name>
              <description>Represents whether command 3 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD4</name>
          <description>I2C command register 4</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND4</name>
              <description>Configures command 4. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND4_DONE</name>
              <description>Represents whether command 4 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD5</name>
          <description>I2C command register 5</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND5</name>
              <description>Configures command 5. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND5_DONE</name>
              <description>Represents whether command 5 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD6</name>
          <description>I2C command register 6</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND6</name>
              <description>Configures command 6. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND6_DONE</name>
              <description>Represents whether command 6 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMD7</name>
          <description>I2C command register 7</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMAND7</name>
              <description>Configures command 7. See details in I2C_COMD0_REG [13:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND7_DONE</name>
              <description>Represents whether command 7 is done in I2C Master mode.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_ST_TIME_OUT</name>
          <description>SCL status timeout register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>SCL_ST_TO_I2C</name>
              <description>Configures the threshold value of SCL_FSM state unchanged period. It should be no more than 23, more than 1.\\
\[
\text{Threshold} = 2^{\text{I2C_SCL_ST_TO_I2C} - 1}
\]

Measurement unit: I2C_SCLK \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_MAIN_ST_TIME_OUT</name>
          <description>SCL main status timeout register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>SCL_MAIN_ST_TO_I2C</name>
              <description>Configures the threshold value of SCL_MAIN_FSM state unchanged period. It should be no more than 23.\\
Measurement unit: I2C_SCLK \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_SP_CONF</name>
          <description>Power configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SCL_RST_SLV_EN</name>
              <description>Configures whether or not to send out SCL pulses when I2C master is IDLE. The number of pulses equals to I2C_SCL_RST_SLV_NUM[4:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL_RST_SLV_NUM</name>
              <description>Configure the pulses of SCL generated in I2C Master mode. \\
Valid when I2C_SCL_RST_SLV_EN is 1.\\
Measurement unit: I2C_SCLK \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL_PD_EN</name>
              <description>Configures whether or not to power down the I2C output SCL line. \\
0: Not power down\\
1: Power down\\
Valid only when I2C_SCL_FORCE_OUT is 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA_PD_EN</name>
              <description>Configures whether or not to power down the I2C output SDA line. \\
0: Not power down\\
1: Power down\\
Valid only when I2C_SDA_FORCE_OUT is 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_STRETCH_CONF</name>
          <description>SCL stretch setting register of I2C slave</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STRETCH_PROTECT_NUM</name>
              <description>Configures the time period to release the SCL line from stretching to avoid timing violation. Usually it should be larger than the SDA setup time.\\
Measurement unit: I2C_SCLK \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLAVE_SCL_STRETCH_EN</name>
              <description>Configures whether to enable slave SCL stretch function. The SCL output line will be stretched low when I2C_SLAVE_SCL_STRETCH_EN is 1 and stretch event happens. The stretch cause can be seen in I2C_STRETCH_CAUSE.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLAVE_SCL_STRETCH_CLR</name>
              <description>Configures whether or not to clear the I2C slave SCL stretch function.\\
0: No effect \\
1: Clear\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLAVE_BYTE_ACK_CTL_EN</name>
              <description>Configures whether to enable the function for slave to control ACK level.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLAVE_BYTE_ACK_LVL</name>
              <description>Configures the ACK level when slave controlling ACK level function enables.\\
0: Low level\\
1: High level \\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x2201172</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFO_START_ADDR</name>
          <description>I2C TXFIFO base address register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXFIFO_START_ADDR</name>
              <description>Represents the I2C TX FIFO first address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFO_START_ADDR</name>
          <description>I2C RXFIFO base address register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFIFO_START_ADDR</name>
              <description>Represents the I2C RX FIFO first address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
