esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>EVT_TASK_EN0</name>
          <description>Ledc event task enable bit register0.</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVT_DUTY_CHNG_END_CH0_EN</name>
              <description>Ledc ch0 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH1_EN</name>
              <description>Ledc ch1 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH2_EN</name>
              <description>Ledc ch2 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH3_EN</name>
              <description>Ledc ch3 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH4_EN</name>
              <description>Ledc ch4 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH5_EN</name>
              <description>Ledc ch5 duty change end event enable register, write 1 to enable this event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH0_EN</name>
              <description>Ledc ch0 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH1_EN</name>
              <description>Ledc ch1 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH2_EN</name>
              <description>Ledc ch2 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH3_EN</name>
              <description>Ledc ch3 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH4_EN</name>
              <description>Ledc ch4 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH5_EN</name>
              <description>Ledc ch5 overflow count pulse event enable register, write 1 to enable this event.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER0_EN</name>
              <description>Ledc timer0 overflow event enable register, write 1 to enable this event.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER1_EN</name>
              <description>Ledc timer1 overflow event enable register, write 1 to enable this event.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER2_EN</name>
              <description>Ledc timer2 overflow event enable register, write 1 to enable this event.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER3_EN</name>
              <description>Ledc timer3 overflow event enable register, write 1 to enable this event.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME0_CMP_EN</name>
              <description>Ledc timer0 compare event enable register, write 1 to enable this event.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME1_CMP_EN</name>
              <description>Ledc timer1 compare event enable register, write 1 to enable this event.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME2_CMP_EN</name>
              <description>Ledc timer2 compare event enable register, write 1 to enable this event.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME3_CMP_EN</name>
              <description>Ledc timer3 compare event enable register, write 1 to enable this event.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH0_EN</name>
              <description>Ledc ch0 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH1_EN</name>
              <description>Ledc ch1 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH2_EN</name>
              <description>Ledc ch2 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH3_EN</name>
              <description>Ledc ch3 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH4_EN</name>
              <description>Ledc ch4 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH5_EN</name>
              <description>Ledc ch5 duty scale update task enable register, write 1 to enable this task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_TASK_EN1</name>
          <description>Ledc event task enable bit register1.</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_TIMER0_RES_UPDATE_EN</name>
              <description>Ledc timer0 res update task enable register, write 1 to enable this task.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RES_UPDATE_EN</name>
              <description>Ledc timer1 res update task enable register, write 1 to enable this task.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RES_UPDATE_EN</name>
              <description>Ledc timer2 res update task enable register, write 1 to enable this task.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RES_UPDATE_EN</name>
              <description>Ledc timer3 res update task enable register, write 1 to enable this task.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_CAP_EN</name>
              <description>Ledc timer0 capture task enable register, write 1 to enable this task.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_CAP_EN</name>
              <description>Ledc timer1 capture task enable register, write 1 to enable this task.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_CAP_EN</name>
              <description>Ledc timer2 capture task enable register, write 1 to enable this task.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_CAP_EN</name>
              <description>Ledc timer3 capture task enable register, write 1 to enable this task.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH0_EN</name>
              <description>Ledc ch0 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH1_EN</name>
              <description>Ledc ch1 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH2_EN</name>
              <description>Ledc ch2 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH3_EN</name>
              <description>Ledc ch3 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH4_EN</name>
              <description>Ledc ch4 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH5_EN</name>
              <description>Ledc ch5 signal out disable task enable register, write 1 to enable this task.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH0_EN</name>
              <description>Ledc ch0 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH1_EN</name>
              <description>Ledc ch1 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH2_EN</name>
              <description>Ledc ch2 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH3_EN</name>
              <description>Ledc ch3 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH4_EN</name>
              <description>Ledc ch4 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH5_EN</name>
              <description>Ledc ch5 overflow count reset task enable register, write 1 to enable this task.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_RST_EN</name>
              <description>Ledc timer0 reset task enable register, write 1 to enable this task.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RST_EN</name>
              <description>Ledc timer1 reset task enable register, write 1 to enable this task.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RST_EN</name>
              <description>Ledc timer2 reset task enable register, write 1 to enable this task.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RST_EN</name>
              <description>Ledc timer3 reset task enable register, write 1 to enable this task.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_PAUSE_RESUME_EN</name>
              <description>Ledc timer0 pause resume task enable register, write 1 to enable this task.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_PAUSE_RESUME_EN</name>
              <description>Ledc timer1 pause resume task enable register, write 1 to enable this task.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_PAUSE_RESUME_EN</name>
              <description>Ledc timer2 pause resume task enable register, write 1 to enable this task.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_PAUSE_RESUME_EN</name>
              <description>Ledc timer3 pause resume task enable register, write 1 to enable this task.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
