esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>EVT_EN</name>
          <description>MCPWM event enable register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVT_TIMER0_STOP_EN</name>
              <description>set this bit high to enable timer0 stop event generate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER1_STOP_EN</name>
              <description>set this bit high to enable timer1 stop event generate</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER2_STOP_EN</name>
              <description>set this bit high to enable timer2 stop event generate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER0_TEZ_EN</name>
              <description>set this bit high to enable timer0 equal zero event generate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER1_TEZ_EN</name>
              <description>set this bit high to enable timer1 equal zero event generate</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER2_TEZ_EN</name>
              <description>set this bit high to enable timer2 equal zero event generate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER0_TEP_EN</name>
              <description>set this bit high to enable timer0 equal period event generate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER1_TEP_EN</name>
              <description>set this bit high to enable timer1 equal period event generate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIMER2_TEP_EN</name>
              <description>set this bit high to enable timer2 equal period event generate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP0_TEA_EN</name>
              <description>set this bit high to enable PWM generator0 timer equal a event generate</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP1_TEA_EN</name>
              <description>set this bit high to enable PWM generator1 timer equal a event generate</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP2_TEA_EN</name>
              <description>set this bit high to enable PWM generator2 timer equal a event generate</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP0_TEB_EN</name>
              <description>set this bit high to enable PWM generator0 timer equal b event generate</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP1_TEB_EN</name>
              <description>set this bit high to enable PWM generator1 timer equal b event generate</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OP2_TEB_EN</name>
              <description>set this bit high to enable PWM generator2 timer equal b event generate</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F0_EN</name>
              <description>set this bit high to enable fault0 event generate</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F1_EN</name>
              <description>set this bit high to enable fault1 event generate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F2_EN</name>
              <description>set this bit high to enable fault2 event generate</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F0_CLR_EN</name>
              <description>set this bit high to enable fault0 clear event generate</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F1_CLR_EN</name>
              <description>set this bit high to enable fault1 clear event generate</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_F2_CLR_EN</name>
              <description>set this bit high to enable fault2 clear event generate</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ0_CBC_EN</name>
              <description>set this bit high to enable cycle by cycle trip0 event generate</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ1_CBC_EN</name>
              <description>set this bit high to enable cycle by cycle trip1 event generate</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ2_CBC_EN</name>
              <description>set this bit high to enable cycle by cycle trip2 event generate</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ0_OST_EN</name>
              <description>set this bit high to enable one shot trip0 event generate</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ1_OST_EN</name>
              <description>set this bit high to enable one shot trip1 event generate</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TZ2_OST_EN</name>
              <description>set this bit high to enable one shot trip2 event generate</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_CAP0_EN</name>
              <description>set this bit high to enable capture0 event generate</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_CAP1_EN</name>
              <description>set this bit high to enable capture1 event generate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_CAP2_EN</name>
              <description>set this bit high to enable capture2 event generate</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TASK_EN</name>
          <description>MCPWM task enable register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_CMPR0_A_UP_EN</name>
              <description>set this bit high to enable PWM generator0 timer stamp A's shadow register update task receive</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR1_A_UP_EN</name>
              <description>set this bit high to enable PWM generator1 timer stamp A's shadow register update task receive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR2_A_UP_EN</name>
              <description>set this bit high to enable PWM generator2 timer stamp A's shadow register update task receive</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR0_B_UP_EN</name>
              <description>set this bit high to enable PWM generator0 timer stamp B's shadow register update task receive</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR1_B_UP_EN</name>
              <description>set this bit high to enable PWM generator1 timer stamp B's shadow register update task receive</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CMPR2_B_UP_EN</name>
              <description>set this bit high to enable PWM generator2 timer stamp B's shadow register update task receive</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GEN_STOP_EN</name>
              <description>set this bit high to enable all PWM generate stop task receive</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_SYNC_EN</name>
              <description>set this bit high to enable timer0 sync task receive</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_SYNC_EN</name>
              <description>set this bit high to enable timer1 sync task receive</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_SYNC_EN</name>
              <description>set this bit high to enable timer2 sync task receive</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_PERIOD_UP_EN</name>
              <description>set this bit high to enable timer0 period update task receive</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_PERIOD_UP_EN</name>
              <description>set this bit high to enable timer1 period update task receive</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_PERIOD_UP_EN</name>
              <description>set this bit high to enable timer2 period update task receive</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ0_OST_EN</name>
              <description>set this bit high to enable one shot trip0 task receive</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ1_OST_EN</name>
              <description>set this bit high to enable one shot trip1 task receive</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TZ2_OST_EN</name>
              <description>set this bit high to enable one shot trip2 task receive</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR0_OST_EN</name>
              <description>set this bit high to enable one shot trip0 clear task receive</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR1_OST_EN</name>
              <description>set this bit high to enable one shot trip1 clear task receive</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CLR2_OST_EN</name>
              <description>set this bit high to enable one shot trip2 clear task receive</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP0_EN</name>
              <description>set this bit high to enable capture0 task receive</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP1_EN</name>
              <description>set this bit high to enable capture1 task receive</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_CAP2_EN</name>
              <description>set this bit high to enable capture2 task receive</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>MCPWM APB configuration register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Force clock on for this register file</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version register.</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0x2201240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version of this register file</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
