esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>CTRL</name>
          <description>Control register for all counters</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>PULSE_CNT_RST_U0</name>
              <description>Set this bit to clear unit 0's counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_PAUSE_U0</name>
              <description>Set this bit to freeze unit 0's counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULSE_CNT_RST_U1</name>
              <description>Set this bit to clear unit 1's counter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_PAUSE_U1</name>
              <description>Set this bit to freeze unit 1's counter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULSE_CNT_RST_U2</name>
              <description>Set this bit to clear unit 2's counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_PAUSE_U2</name>
              <description>Set this bit to freeze unit 2's counter.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULSE_CNT_RST_U3</name>
              <description>Set this bit to clear unit 3's counter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_PAUSE_U3</name>
              <description>Set this bit to freeze unit 3's counter.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DALTA_CHANGE_EN_U0</name>
              <description>Configures this bit to enable unit 0's step comparator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DALTA_CHANGE_EN_U1</name>
              <description>Configures this bit to enable unit 1's step comparator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DALTA_CHANGE_EN_U2</name>
              <description>Configures this bit to enable unit 2's step comparator.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DALTA_CHANGE_EN_U3</name>
              <description>Configures this bit to enable unit 3's step comparator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>The registers clock gate enable signal of PCNT module. 1: the registers can be read and written by application. 0: the registers can not be read or written by application</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>PCNT version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2407310</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCR</name>
      <description>PCR Peripheral</description>
      <groupName>PCR</groupName>
      <baseAddress>0x60096000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x164</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UART0_CONF</name>
          <description>UART0 configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>UART0_CLK_EN</name>
              <description>Set 1 to enable uart0 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_RST_EN</name>
              <description>Set 0 to reset uart0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_READY</name>
              <description>Query this field after reset uart0 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_SCLK_CONF</name>
          <description>UART0_SCLK configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x700000</resetValue>
          <fields>
            <field>
              <name>UART0_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the uart0 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1: 80MHz, 2: FOSC, 3(default): XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_SCLK_EN</name>
              <description>Set 1 to enable uart0 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_PD_CTRL</name>
          <description>UART0 power control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>UART0_MEM_FORCE_PU</name>
              <description>Set this bit to force power down UART0 memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_MEM_FORCE_PD</name>
              <description>Set this bit to force power up UART0 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_CONF</name>
          <description>UART1 configuration register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>UART1_CLK_EN</name>
              <description>Set 1 to enable uart1 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_RST_EN</name>
              <description>Set 0 to reset uart1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_READY</name>
              <description>Query this field after reset uart1 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_SCLK_CONF</name>
          <description>UART1_SCLK configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x700000</resetValue>
          <fields>
            <field>
              <name>UART1_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the uart1 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1: 80MHz, 2: FOSC, 3(default): XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_SCLK_EN</name>
              <description>Set 1 to enable uart0 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_PD_CTRL</name>
          <description>UART1 power control register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>UART1_MEM_FORCE_PU</name>
              <description>Set this bit to force power down UART1 memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_MEM_FORCE_PD</name>
              <description>Set this bit to force power up UART1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_CONF</name>
          <description>MSPI configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x25</resetValue>
          <fields>
            <field>
              <name>MSPI_CLK_EN</name>
              <description>Set 1 to enable mspi clock, include mspi pll clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_RST_EN</name>
              <description>Set 0 to reset mspi module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_PLL_CLK_EN</name>
              <description>Set 1 to enable mspi pll clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_CLK_SEL</name>
              <description>set this field to select clock-source.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_READY</name>
              <description>Query this field after reset mspi module</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_CLK_CONF</name>
          <description>MSPI_CLK configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSPI_FAST_DIV_NUM</name>
              <description>Set as one within (0,1,2) to generate div1(default)/div2/div4 of low-speed clock-source to drive clk_mspi_fast. Only avaiable whe the clck-source is a low-speed clock-source such as XTAL/FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C0_CONF</name>
          <description>I2C configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>I2C0_CLK_EN</name>
              <description>Set 1 to enable i2c apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_RST_EN</name>
              <description>Set 0 to reset i2c module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_READY</name>
              <description>Query this field after reset i2c0 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C0_SCLK_CONF</name>
          <description>I2C_SCLK configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>I2C0_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_SCLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: FOSC.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0_SCLK_EN</name>
              <description>Set 1 to enable i2c function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_CONF</name>
          <description>I2C configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>I2C1_CLK_EN</name>
              <description>Set 1 to enable i2c apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_RST_EN</name>
              <description>Set 0 to reset i2c module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_READY</name>
              <description>Query this field after reset i2c1 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_SCLK_CONF</name>
          <description>I2C_SCLK configuration register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>I2C1_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the i2c function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: FOSC.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_EN</name>
              <description>Set 1 to enable i2c function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI_CONF</name>
          <description>UHCI configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>UHCI_CLK_EN</name>
              <description>Set 1 to enable uhci clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI_RST_EN</name>
              <description>Set 0 to reset uhci module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI_READY</name>
              <description>Query this field after reset uhci module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_CONF</name>
          <description>RMT configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>RMT_CLK_EN</name>
              <description>Set 1 to enable rmt apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_RST_EN</name>
              <description>Set 0 to reset rmt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_READY</name>
              <description>Query this field after reset rmt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
