esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SARADC_CONF</name>
          <description>SARADC configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SARADC_CLK_EN</name>
              <description>no use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_RST_EN</name>
              <description>Set 0 to reset function_register of saradc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_CLK_EN</name>
              <description>Set 1 to enable saradc apb clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_RST_EN</name>
              <description>Set 0 to reset apb_register of saradc module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARADC_CLKM_CONF</name>
          <description>SARADC_CLKM configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x404000</resetValue>
          <fields>
            <field>
              <name>SARADC_CLKM_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_B</name>
              <description>The numerator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 240MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_EN</name>
              <description>Set 1 to enable saradc function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSENS_CLK_CONF</name>
          <description>TSENS_CLK configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>TSENS_CLK_SEL</name>
              <description>set this field to select clock-source. 0(default): FOSC, 1: XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_EN</name>
              <description>Set 1 to enable tsens clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_RST_EN</name>
              <description>Set 0 to reset tsens module</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_CONF</name>
          <description>USB_DEVICE configuration register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>USB_DEVICE_CLK_EN</name>
              <description>Set 1 to enable usb_device clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_RST_EN</name>
              <description>Set 0 to reset usb_device module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_READY</name>
              <description>Query this field after reset usb_device module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMTX_CONF</name>
          <description>INTMTX configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>INTMTX_CLK_EN</name>
              <description>Set 1 to enable intmtx clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_RST_EN</name>
              <description>Set 0 to reset intmtx module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_CONF</name>
          <description>PCNT configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>PCNT_CLK_EN</name>
              <description>Set 1 to enable pcnt clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_RST_EN</name>
              <description>Set 0 to reset pcnt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_READY</name>
              <description>Query this field after reset pcnt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_CONF</name>
          <description>ETM configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ETM_CLK_EN</name>
              <description>Set 1 to enable etm clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_RST_EN</name>
              <description>Set 0 to reset etm module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_READY</name>
              <description>Query this field after reset etm module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CONF</name>
          <description>PWM configuration register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>PWM_CLK_EN</name>
              <description>Set 1 to enable pwm clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_RST_EN</name>
              <description>Set 0 to reset pwm module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_READY</name>
              <description>Query this field after reset pwm module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CLK_CONF</name>
          <description>PWM_CLK configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x404000</resetValue>
          <fields>
            <field>
              <name>PWM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pwm function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_CLKM_SEL</name>
              <description>set this field to select clock-source. 0(default): do not select anyone clock, 1: 160MHz, 2: XTAL, 3: FOSC.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_CLKM_EN</name>
              <description>set this field as 1 to activate pwm clkm.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_CONF</name>
          <description>PARL_IO configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>PARL_CLK_EN</name>
              <description>Set 1 to enable parl apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RST_EN</name>
              <description>Set 0 to reset parl apb reg</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_READY</name>
              <description>Query this field after reset parl module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_RX_CONF</name>
          <description>PARL_CLK_RX configuration register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x40000</resetValue>
          <fields>
            <field>
              <name>PARL_CLK_RX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl rx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 240MHz, 2: FOSC, 3: user clock from pad.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_EN</name>
              <description>Set 1 to enable parl rx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RX_RST_EN</name>
              <description>Set 0 to reset parl rx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_TX_CONF</name>
          <description>PARL_CLK_TX configuration register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x40000</resetValue>
          <fields>
            <field>
              <name>PARL_CLK_TX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl tx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 240MHz, 2: FOSC, 3: user clock from pad.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_EN</name>
              <description>Set 1 to enable parl tx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_TX_RST_EN</name>
              <description>Set 0 to reset parl tx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_CONF</name>
          <description>PVT_MONITOR configuration register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x1d</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_CLK_EN</name>
              <description>Set 1 to enable apb clock of pvt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_RST_EN</name>
              <description>Set 0 to reset all pvt monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE1_CLK_EN</name>
              <description>Set 1 to enable function clock of modem pvt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE2_CLK_EN</name>
              <description>Set 1 to enable function clock of cpu pvt module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE3_CLK_EN</name>
              <description>Set 1 to enable function clock of hp_peri pvt module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_FUNC_CLK_CONF</name>
          <description>PVT_MONITOR function clock configuration register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pvt_monitor function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_SEL</name>
              <description>set this field to select clock-source. 0: XTAL, 1(default): 160MHz drived by SPLL divided by 3.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_EN</name>
              <description>Set 1 to enable source clock of pvt sitex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CONF</name>
          <description>GDMA configuration register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>GDMA_CLK_EN</name>
              <description>Set 1 to enable gdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_RST_EN</name>
              <description>Set 0 to reset gdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CONF</name>
          <description>SPI2 configuration register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set 1 to enable spi2 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_RST_EN</name>
              <description>Set 0 to reset spi2 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_READY</name>
              <description>Query this field after reset spi2 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CLKM_CONF</name>
          <description>SPI2_CLKM configuration register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>SPI2_CLKM_SEL</name>
              <description>set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2: FOSC, 3: reserved.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_EN</name>
              <description>Set 1 to enable spi2 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CONF</name>
          <description>AES configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>AES_CLK_EN</name>
              <description>Set 1 to enable aes clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_RST_EN</name>
              <description>Set 0 to reset aes module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_READY</name>
              <description>Query this field after reset aes module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONF</name>
          <description>SHA configuration register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SHA_CLK_EN</name>
              <description>Set 1 to enable sha clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RST_EN</name>
              <description>Set 0 to reset sha module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_READY</name>
              <description>Query this field after reset sha module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
