esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>RSA_CONF</name>
          <description>RSA configuration register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>RSA_CLK_EN</name>
              <description>Set 1 to enable rsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_RST_EN</name>
              <description>Set 0 to reset rsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_READY</name>
              <description>Query this field after reset rsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_PD_CTRL</name>
          <description>RSA power control register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RSA_MEM_PD</name>
              <description>Set this bit to power down rsa internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PU</name>
              <description>Set this bit to force power up rsa internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PD</name>
              <description>Set this bit to force power down rsa internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ECC_CLK_EN</name>
              <description>Set 1 to enable ecc clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_RST_EN</name>
              <description>Set 0 to reset ecc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_READY</name>
              <description>Query this field after reset ecc module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PD_CTRL</name>
          <description>ECC power control register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ECC_MEM_PD</name>
              <description>Set this bit to power down ecc internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_PU</name>
              <description>Set this bit to force power up ecc internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_PD</name>
              <description>Set this bit to force power down ecc internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_CONF</name>
          <description>DS configuration register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>DS_CLK_EN</name>
              <description>Set 1 to enable ds clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_RST_EN</name>
              <description>Set 0 to reset ds module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_READY</name>
              <description>Query this field after reset ds module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HMAC_CONF</name>
          <description>HMAC configuration register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>HMAC_CLK_EN</name>
              <description>Set 1 to enable hmac clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_RST_EN</name>
              <description>Set 0 to reset hmac module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_READY</name>
              <description>Query this field after reset hmac module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA_CONF</name>
          <description>ECDSA configuration register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ECDSA_CLK_EN</name>
              <description>Set 1 to enable ecdsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSA_RST_EN</name>
              <description>Set 0 to reset ecdsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSA_READY</name>
              <description>Query this field after reset ecdsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMUX_CONF</name>
          <description>IOMUX configuration register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>IOMUX_CLK_EN</name>
              <description>Set 1 to enable iomux apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX_RST_EN</name>
              <description>Set 0 to reset iomux module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMUX_CLK_CONF</name>
          <description>IOMUX_CLK configuration register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>IOMUX_FUNC_CLK_SEL</name>
              <description>set this field to select clock-source. 0: do not select anyone clock, 1: 80MHz, 2: FOSC, 3(default): XTAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX_FUNC_CLK_EN</name>
              <description>Set 1 to enable iomux function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_MONITOR_CONF</name>
          <description>MEM_MONITOR configuration register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_MONITOR_RST_EN</name>
              <description>Set 0 to reset mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_MONITOR_READY</name>
              <description>Query this field after reset mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGDMA_CONF</name>
          <description>REGDMA configuration register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGDMA_CLK_EN</name>
              <description>Set 1 to enable regdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_RST_EN</name>
              <description>Set 0 to reset regdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACE_CONF</name>
          <description>TRACE configuration register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>TRACE_CLK_EN</name>
              <description>Set 1 to enable trace clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACE_RST_EN</name>
              <description>Set 0 to reset trace module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIST_CONF</name>
          <description>ASSIST configuration register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>ASSIST_CLK_EN</name>
              <description>Set 1 to enable assist clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASSIST_RST_EN</name>
              <description>Set 0 to reset assist module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CONF</name>
          <description>CACHE configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CACHE_CLK_EN</name>
              <description>Set 1 to enable cache clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_RST_EN</name>
              <description>Set 0 to reset cache module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CONF</name>
          <description>MODEM_APB configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>MODEM_CLK_SEL</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_CLK_EN</name>
              <description>xxxx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_RST_EN</name>
              <description>Set this file as 1 to reset modem-subsystem.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT_CONF</name>
          <description>TIMEOUT configuration register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_TIMEOUT_RST_EN</name>
              <description>Set 0 to reset cpu_peri timeout module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TIMEOUT_RST_EN</name>
              <description>Set 0 to reset hp_peri timeout module and hp_modem timeout module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_CONF</name>
          <description>SYSCLK configuration register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x20000200</resetValue>
          <fields>
            <field>
              <name>LS_DIV_NUM</name>
              <description>clk_hproot is div1 of low-speed clock-source if clck-source is a low-speed clock-source such as XTAL/FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_DIV_NUM</name>
              <description>clk_hproot is div3 of SPLL if the clock-source is high-speed clock SPLL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_CLK_SEL</name>
              <description>This field is used to select clock source. 0: XTAL, 1: SPLL, 2: FOSC, 3: reserved.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_FREQ</name>
              <description>This field indicates the frequency(MHz) of XTAL.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAITI_CONF</name>
          <description>CPU_WAITI configuration register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0xd</resetValue>
          <fields>
            <field>
              <name>CPUPERIOD_SEL</name>
              <description>Reserved. This filed has been replaced by PCR_CPU_DIV_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_FREQ_SEL</name>
              <description>Reserved. This filed has been replaced by PCR_CPU_DIV_NUM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_WAIT_MODE_FORCE_ON</name>
              <description>Set 1 to force cpu_waiti_clk enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAITI_DELAY_NUM</name>
              <description>This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk will close</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_FREQ_CONF</name>
          <description>CPU_FREQ configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_DIV_NUM</name>
              <description>Set this field to generate clk_cpu drived by clk_hproot. The clk_cpu is div1(default)/div2/div4 of clk_hproot. This field is only avaliable for low-speed clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_DIV_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_FREQ_CONF</name>
          <description>AHB_FREQ configuration register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DIV_NUM</name>
              <description>Set this field to generate clk_ahb drived by clk_hproot. The clk_ahb is div1(default)/div2/div4/div8 of clk_hproot. This field is only avaliable for low-speed clock-source such as XTAL/FOSC, and should be used together with PCR_CPU_DIV_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FREQ_CONF</name>
          <description>APB_FREQ configuration register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB_DECREASE_DIV_NUM</name>
              <description>If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be automatically down to clk_apb_decrease only when no access is on apb-bus, and will recover to the previous frequency when a new access appears on apb-bus. Set as one within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note that enable this function will reduce performance. Users can set this field as zero to disable the auto-decrease-apb-freq function. By default, this function is disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_DIV_NUM</name>
              <description>Set as one within (0,1,3) to generate clk_apb drived by clk_ahb. The clk_apb is div1(default)/div2/div4 of clk_ahb.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_FREQ_QUERY_0</name>
          <description>SYSCLK frequency query 0 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x6008</resetValue>
          <fields>
            <field>
              <name>FOSC_FREQ</name>
              <description>This field indicates the frequency(MHz) of FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_FREQ</name>
              <description>This field indicates the frequency(MHz) of SPLL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
