esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_END_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_END_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH2_RX_END_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_RX_END_INT_CLR</name>
              <description>Set this bit to clear theCH3_RX_END_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH4_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH6_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_ERR_INT_CLR</name>
              <description>Set this bit to clear theCH7_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH2_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3_RX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear theCH3_RX_THR_EVENT_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH0_TX_LOOP_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear theCH1_TX_LOOP_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCARRIER_DUTY</name>
          <description>Channel %s duty cycle configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW_CH</name>
              <description>This register is used to configure carrier wave 's low level clock period for CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH_CH</name>
              <description>This register is used to configure carrier wave 's high level clock period for CHANNEL%s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>2,3</dimIndex>
          <name>CH%s_RX_CARRIER_RM</name>
          <description>Channel %s carrier remove register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CARRIER_LOW_THRES_CH</name>
              <description>The low level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_LOW_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH_THRES_CH</name>
              <description>The high level period in a carrier modulation mode is (REG_RMT_REG_CARRIER_HIGH_THRES_CH%s + 1) for channel %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_TX_LIM</name>
          <description>Channel %s Tx event configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>TX_LIM_CH</name>
              <description>This register is used to configure the maximum entries that CHANNEL%s can send out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LOOP_NUM_CH</name>
              <description>This register is used to configure the maximum loop count when tx_conti_mode is valid.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_LOOP_CNT_EN_CH</name>
              <description>This register is the enabled bit for loop count.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP_COUNT_RESET_CH</name>
              <description>This register is used to reset the loop count when tx_conti_mode is valid.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOOP_STOP_EN_CH</name>
              <description>This bit is used to enable the loop send stop function after the loop counter counts to  loop number for CHANNEL%s.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>2,3</dimIndex>
          <name>CH%s_RX_LIM</name>
          <description>Channel %s Rx event configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>RMT_RX_LIM_CH2</name>
              <description>This register is used to configure the maximum entries that CHANNEL%s can receive.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CONF</name>
          <description>RMT apb configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x5000010</resetValue>
          <fields>
            <field>
              <name>APB_FIFO_MASK</name>
              <description>1'h1: access memory directly.   1'h0: access memory by FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_FORCE_ON</name>
              <description>Set this bit to enable the clock for RMT memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_MEM_FORCE_PD</name>
              <description>Set this bit to power down RMT memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_MEM_FORCE_PU</name>
              <description>1: Disable RMT memory light sleep power down function. 0: Power down RMT memory when RMT is in light sleep mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_NUM</name>
              <description>the integral part of the fractional divisor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_A</name>
              <description>the numerator of the fractional part of the fractional divisor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_B</name>
              <description>the denominator of the fractional part of the fractional divisor</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_SEL</name>
              <description>choose the clock source of rmt_sclk. 1:CLK_80Mhz,2:CLK_FOSC, 3:XTAL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_ACTIVE</name>
              <description>rmt_sclk switch</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>RMT register clock gate enable signal. 1: Power up the drive clock of registers. 0: Power down the drive clock of registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SIM</name>
          <description>RMT TX synchronous register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>Set this bit to enable CHANNEL0 to start sending data synchronously with other enabled channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Set this bit to enable CHANNEL1 to start sending data synchronously with other enabled channels.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>This register is used to enable multiple of channels to start sending data synchronously.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_RST</name>
          <description>RMT clock divider reset register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>This register is used to reset the clock divider of CHANNEL0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>This register is used to reset the clock divider of CHANNEL1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2</name>
              <description>This register is used to reset the clock divider of CHANNEL2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3</name>
              <description>This register is used to reset the clock divider of CHANNEL3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>RMT version register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x2108213</resetValue>
          <fields>
            <field>
              <name>RMT_DATE</name>
              <description>This is the version register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
