esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SOC_ETM</name>
      <description>Event Task Matrix</description>
      <groupName>SOC_ETM</groupName>
      <baseAddress>0x60013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1b0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CH_ENA_AD0</name>
          <description>Channel enable status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_ENABLED0</name>
              <description>Represents channel0 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED1</name>
              <description>Represents channel1 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED2</name>
              <description>Represents channel2 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED3</name>
              <description>Represents channel3 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED4</name>
              <description>Represents channel4 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED5</name>
              <description>Represents channel5 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED6</name>
              <description>Represents channel6 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED7</name>
              <description>Represents channel7 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED8</name>
              <description>Represents channel8 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED9</name>
              <description>Represents channel9 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED10</name>
              <description>Represents channel10 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED11</name>
              <description>Represents channel11 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED12</name>
              <description>Represents channel12 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED13</name>
              <description>Represents channel13 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED14</name>
              <description>Represents channel14 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED15</name>
              <description>Represents channel15 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED16</name>
              <description>Represents channel16 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED17</name>
              <description>Represents channel17 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED18</name>
              <description>Represents channel18 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED19</name>
              <description>Represents channel19 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED20</name>
              <description>Represents channel20 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED21</name>
              <description>Represents channel21 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED22</name>
              <description>Represents channel22 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED23</name>
              <description>Represents channel23 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED24</name>
              <description>Represents channel24 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED25</name>
              <description>Represents channel25 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED26</name>
              <description>Represents channel26 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED27</name>
              <description>Represents channel27 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED28</name>
              <description>Represents channel28 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED29</name>
              <description>Represents channel29 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED30</name>
              <description>Represents channel30 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED31</name>
              <description>Represents channel31 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD0_SET</name>
          <description>Channel enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_ENABLE0</name>
              <description>Configures whether or not to enable channel0.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE1</name>
              <description>Configures whether or not to enable channel1.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE2</name>
              <description>Configures whether or not to enable channel2.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE3</name>
              <description>Configures whether or not to enable channel3.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE4</name>
              <description>Configures whether or not to enable channel4.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE5</name>
              <description>Configures whether or not to enable channel5.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE6</name>
              <description>Configures whether or not to enable channel6.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE7</name>
              <description>Configures whether or not to enable channel7.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE8</name>
              <description>Configures whether or not to enable channel8.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE9</name>
              <description>Configures whether or not to enable channel9.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE10</name>
              <description>Configures whether or not to enable channel10.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE11</name>
              <description>Configures whether or not to enable channel11.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE12</name>
              <description>Configures whether or not to enable channel12.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE13</name>
              <description>Configures whether or not to enable channel13.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE14</name>
              <description>Configures whether or not to enable channel14.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE15</name>
              <description>Configures whether or not to enable channel15.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE16</name>
              <description>Configures whether or not to enable channel16.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE17</name>
              <description>Configures whether or not to enable channel17.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE18</name>
              <description>Configures whether or not to enable channel18.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE19</name>
              <description>Configures whether or not to enable channel19.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE20</name>
              <description>Configures whether or not to enable channel20.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE21</name>
              <description>Configures whether or not to enable channel21.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE22</name>
              <description>Configures whether or not to enable channel22.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE23</name>
              <description>Configures whether or not to enable channel23.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE24</name>
              <description>Configures whether or not to enable channel24.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE25</name>
              <description>Configures whether or not to enable channel25.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE26</name>
              <description>Configures whether or not to enable channel26.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE27</name>
              <description>Configures whether or not to enable channel27.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE28</name>
              <description>Configures whether or not to enable channel28.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE29</name>
              <description>Configures whether or not to enable channel29.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE30</name>
              <description>Configures whether or not to enable channel30.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE31</name>
              <description>Configures whether or not to enable channel31.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
