esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>CH_ENA_AD0_CLR</name>
          <description>Channel disable register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_DISABLE0</name>
              <description>Configures whether or not to disable channel0.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE1</name>
              <description>Configures whether or not to disable channel1.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE2</name>
              <description>Configures whether or not to disable channel2.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE3</name>
              <description>Configures whether or not to disable channel3.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE4</name>
              <description>Configures whether or not to disable channel4.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE5</name>
              <description>Configures whether or not to disable channel5.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE6</name>
              <description>Configures whether or not to disable channel6.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE7</name>
              <description>Configures whether or not to disable channel7.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE8</name>
              <description>Configures whether or not to disable channel8.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE9</name>
              <description>Configures whether or not to disable channel9.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE10</name>
              <description>Configures whether or not to disable channel10.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE11</name>
              <description>Configures whether or not to disable channel11.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE12</name>
              <description>Configures whether or not to disable channel12.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE13</name>
              <description>Configures whether or not to disable channel13.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE14</name>
              <description>Configures whether or not to disable channel14.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE15</name>
              <description>Configures whether or not to disable channel15.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE16</name>
              <description>Configures whether or not to disable channel16.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE17</name>
              <description>Configures whether or not to disable channel17.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE18</name>
              <description>Configures whether or not to disable channel18.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE19</name>
              <description>Configures whether or not to disable channel19.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE20</name>
              <description>Configures whether or not to disable channel20.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE21</name>
              <description>Configures whether or not to disable channel21.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE22</name>
              <description>Configures whether or not to disable channel22.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE23</name>
              <description>Configures whether or not to disable channel23.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE24</name>
              <description>Configures whether or not to disable channel24.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE25</name>
              <description>Configures whether or not to disable channel25.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE26</name>
              <description>Configures whether or not to disable channel26.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE27</name>
              <description>Configures whether or not to disable channel27.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE28</name>
              <description>Configures whether or not to disable channel28.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE29</name>
              <description>Configures whether or not to disable channel29.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE30</name>
              <description>Configures whether or not to disable channel30.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE31</name>
              <description>Configures whether or not to disable channel31.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD1</name>
          <description>Channel enable status register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_ENABLED32</name>
              <description>Represents channel32 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED33</name>
              <description>Represents channel33 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED34</name>
              <description>Represents channel34 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED35</name>
              <description>Represents channel35 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED36</name>
              <description>Represents channel36 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED37</name>
              <description>Represents channel37 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED38</name>
              <description>Represents channel38 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED39</name>
              <description>Represents channel39 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED40</name>
              <description>Represents channel40 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED41</name>
              <description>Represents channel41 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED42</name>
              <description>Represents channel42 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED43</name>
              <description>Represents channel43 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED44</name>
              <description>Represents channel44 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED45</name>
              <description>Represents channel45 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED46</name>
              <description>Represents channel46 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED47</name>
              <description>Represents channel47 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED48</name>
              <description>Represents channel48 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENABLED49</name>
              <description>Represents channel49 enable status.\\0: Disable\\1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD1_SET</name>
          <description>Channel enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_ENABLE32</name>
              <description>Configures whether or not to enable channel32.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE33</name>
              <description>Configures whether or not to enable channel33.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE34</name>
              <description>Configures whether or not to enable channel34.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE35</name>
              <description>Configures whether or not to enable channel35.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE36</name>
              <description>Configures whether or not to enable channel36.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE37</name>
              <description>Configures whether or not to enable channel37.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE38</name>
              <description>Configures whether or not to enable channel38.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE39</name>
              <description>Configures whether or not to enable channel39.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE40</name>
              <description>Configures whether or not to enable channel40.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE41</name>
              <description>Configures whether or not to enable channel41.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE42</name>
              <description>Configures whether or not to enable channel42.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE43</name>
              <description>Configures whether or not to enable channel43.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE44</name>
              <description>Configures whether or not to enable channel44.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE45</name>
              <description>Configures whether or not to enable channel45.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE46</name>
              <description>Configures whether or not to enable channel46.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE47</name>
              <description>Configures whether or not to enable channel47.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE48</name>
              <description>Configures whether or not to enable channel48.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_ENABLE49</name>
              <description>Configures whether or not to enable channel49.\\0: Invalid. No effect\\1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
