esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>CH_ENA_AD1_CLR</name>
          <description>Channel disable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_DISABLE32</name>
              <description>Configures whether or not to disable channel32.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE33</name>
              <description>Configures whether or not to disable channel33.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE34</name>
              <description>Configures whether or not to disable channel34.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE35</name>
              <description>Configures whether or not to disable channel35.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE36</name>
              <description>Configures whether or not to disable channel36.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE37</name>
              <description>Configures whether or not to disable channel37.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE38</name>
              <description>Configures whether or not to disable channel38.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE39</name>
              <description>Configures whether or not to disable channel39.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE40</name>
              <description>Configures whether or not to disable channel40.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE41</name>
              <description>Configures whether or not to disable channel41.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE42</name>
              <description>Configures whether or not to disable channel42.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE43</name>
              <description>Configures whether or not to disable channel43.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE44</name>
              <description>Configures whether or not to disable channel44.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE45</name>
              <description>Configures whether or not to disable channel45.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE46</name>
              <description>Configures whether or not to disable channel46.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE47</name>
              <description>Configures whether or not to disable channel47.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE48</name>
              <description>Configures whether or not to disable channel48.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE49</name>
              <description>Configures whether or not to disable channel49.\\0: Invalid. No effect\\1: Clear\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>50</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%s_EVT_ID</name>
          <description>Channel%s event ID register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_EVT_ID</name>
              <description>Configures the event ID of channel%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>50</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%s_TASK_ID</name>
          <description>Channel%s task ID register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_TASK_ID</name>
              <description>Configures the task ID of channel%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN</name>
          <description>ETM clock enable register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures resister clock gating.\\
0: Support clock only when application writes registers\\ 
1: Force on clock gating for registers\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0x2203092</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
