esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SPI_MEM_NAND_FLASH_CMD_LUT13</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_VALUE13</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 13.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN13</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 13.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_LEN13</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 13.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_ADDR_LEN13</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 13.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_DATA_LEN13</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 13.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_BUS_EN13</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 13,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT13_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CMD_LUT14</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_VALUE14</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 14.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN14</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 14.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_LEN14</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 14.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_ADDR_LEN14</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 14.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_DATA_LEN14</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 14.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_BUS_EN14</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 14,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT14_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_CMD_LUT15</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_VALUE15</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 15.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_SFSM_ST_EN15</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 15.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_CMD_LEN15</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 15.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_ADDR_LEN15</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 15.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_DATA_LEN15</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 15.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_LUT_BUS_EN15</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 15,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT15_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG0</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN0</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX0</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX0</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG0</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX0</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ1</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG1</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 1.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN1</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 1. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX1</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 1.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX1</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 1.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG1</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 1. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX1</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 1. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ2</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG2</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 2.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN2</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 2. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX2</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 2.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX2</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 2.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG2</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 2. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX2</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 2. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ3</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG3</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 3.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN3</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 3. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX3</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 3.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX3</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 3.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG3</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 3. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX3</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 3. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ4</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG4</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 4.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN4</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 4. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX4</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 4.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX4</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 4.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG4</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 4. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX4</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 4. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ5</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG5</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 5.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN5</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 5. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX5</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 5.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX5</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 5.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG5</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 5. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX5</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 5. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
