esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ6</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG6</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 6.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN6</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 6. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX6</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 6.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX6</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 6.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG6</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 6. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX6</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 6. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ7</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG7</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 7.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN7</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 7. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX7</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 7.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX7</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 7.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG7</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 7. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX7</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 7. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ8</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG8</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 8.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN8</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 8. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX8</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 8.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX8</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 8.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG8</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 8. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX8</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 8. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ9</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG9</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 9.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN9</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 9. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX9</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 9.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX9</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 9.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG9</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 9. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX9</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 9. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ10</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG10</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 10.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN10</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 10. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX10</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 10.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX10</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 10.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG10</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 10. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX10</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 10. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ11</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG11</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 11.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN11</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 11. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX11</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 11.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX11</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 11.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG11</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 11. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX11</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 11. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ12</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG12</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 12.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN12</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 12. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX12</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 12.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX12</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 12.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG12</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 12. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX12</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 12. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ13</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG13</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 13.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN13</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 13. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX13</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 13.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX13</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 13.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG13</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 13. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX13</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 13. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ14</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG14</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 14.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN14</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 14. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX14</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 14.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX14</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 14.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG14</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 14. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX14</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 14. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
