esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ24</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG24</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 24.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN24</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 24. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX24</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 24.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX24</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 24.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG24</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 24. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX24</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 24. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ25</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG25</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 25.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN25</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 25. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX25</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 25.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX25</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 25.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG25</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 25. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX25</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 25. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ26</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG26</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 26.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN26</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 26. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX26</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 26.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX26</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 26.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG26</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 26. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX26</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 26. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ27</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG27</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 27.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN27</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 27. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX27</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 27.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX27</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 27.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG27</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 27. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX27</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 27. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ28</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG28</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 28.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN28</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 28. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX28</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 28.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX28</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 28.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG28</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 28. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX28</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 28. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ29</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG29</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 29.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN29</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 29. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX29</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 29.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX29</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 29.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG29</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 29. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX29</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 29. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ30</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG30</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 30.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN30</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 30. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX30</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 30.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX30</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 30.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG30</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 30. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX30</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 30. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_NAND_FLASH_SPI_SEQ31</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_NAND_FLASH_SEQ_TAIL_FLG31</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 31.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_SR_CHK_EN31</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 31. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_DIN_INDEX31</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 31.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_ADDR_INDEX31</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 31.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_REQ_OR_CFG31</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 31. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_MEM_NAND_FLASH_CMD_INDEX31</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 31. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_PLAIN_BASE</name>
          <description>The base address of the memory that stores plaintext in Manual Encryption</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_PLAIN</name>
              <description>This field is only used to generate include file in c case. This field is useless. Please do not use this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_LINESIZE</name>
          <description>Manual Encryption Line-Size register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_LINESIZE</name>
              <description>This bits stores the line-size parameter which will be used in manual encryption calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1: 32-bytes, 2: 64-bytes, 3:reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_DESTINATION</name>
          <description>Manual Encryption destination register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_DESTINATION</name>
              <description>This bit stores the destination parameter which will be used in manual encryption calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_PHYSICAL_ADDRESS</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_PHYSICAL_ADDRESS</name>
              <description>This bits stores the physical-address parameter which will be used in manual encryption calculation. This value should aligned with byte number decided by line-size parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
