esp-rs/esp-pacs/esp32h21/svd/esp32h21.base.svd
        <register>
          <name>SPI_W7</name>
          <description>SPI CPU-controlled buffer7</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF7</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W8</name>
          <description>SPI CPU-controlled buffer8</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF8</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W9</name>
          <description>SPI CPU-controlled buffer9</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF9</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W10</name>
          <description>SPI CPU-controlled buffer10</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF10</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W11</name>
          <description>SPI CPU-controlled buffer11</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF11</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W12</name>
          <description>SPI CPU-controlled buffer12</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF12</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W13</name>
          <description>SPI CPU-controlled buffer13</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF13</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W14</name>
          <description>SPI CPU-controlled buffer14</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF14</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W15</name>
          <description>SPI CPU-controlled buffer15</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_BUF15</name>
              <description>32-bit data buffer 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SLAVE</name>
          <description>SPI slave control register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x2800000</resetValue>
          <fields>
            <field>
              <name>SPI_CLK_MODE</name>
              <description>Configures SPI clock mode.\\
0: SPI clock is off when CS becomes inactive.\\
1: SPI clock is delayed one cycle after CS becomes inactive.\\
2: SPI clock is delayed two cycles after CS becomes inactive.\\
3: SPI clock is always on.\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLK_MODE_13</name>
              <description>Configure clock mode.\\
0: Support SPI clock mode 0 or 2. See Table &lt;a href='table:clock_pol_slave'&gt;link&lt;/a&gt;.\\
1: Support SPI clock mode 1 or 3. See Table &lt;a href='table:clock_pol_slave'&gt;link&lt;/a&gt;.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_RSCK_DATA_OUT</name>
              <description>Configures the edge of output data.\\
0: Output data at TSCK rising edge.\\
1: Output data at RSCK rising edge.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RDDMA_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Rd_DMA transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WRDMA_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Wr_DMA transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RDBUF_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Rd_BUF transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WRBUF_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Wr_BUF transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_LAST_BYTE_STRB</name>
              <description>Represents the effective bit of the last received data byte in SPI slave FD and HD mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DMA_SEG_MAGIC_VALUE</name>
              <description>Configures the magic value of BM table in DMA-controlled configurable segmented transfer.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Configures SPI work mode.\\
0: Master\\
1: Slave\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SOFT_RESET</name>
              <description>Configures whether to reset the SPI clock line, CS line, and data line via software.\\
0: Not reset\\
1: Reset\\
Can be configured in CONF state.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_USR_CONF</name>
              <description>Configures whether or not to enable the CONF state of current DMA-controlled configurable segmented transfer.\\
0: No effect, which means the current transfer is not a configurable segmented transfer.\\
1: Enable, which means a configurable segmented transfer is started.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_FD_WAIT_DMA_TX_DATA</name>
              <description>Configures whether or not to wait DMA TX data gets ready before starting SPI transfer in master full-duplex transfer.\\
0: Not wait\\
1: Wait\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SLAVE1</name>
          <description>SPI slave control register 1</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_SLV_DATA_BITLEN</name>
              <description>Configures the transferred data bit length in SPI slave full-/half-duplex modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_LAST_COMMAND</name>
              <description>Configures the command value in slave mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_LAST_ADDR</name>
              <description>Configures the address value in slave mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CLK_GATE</name>
          <description>SPI module clock and register clock control</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_CLK_ACTIVE</name>
              <description>Set this bit to power on the SPI module clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_CLK_SEL</name>
              <description>This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80M. 0: XTAL CLK.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DATE</name>
          <description>Version control</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x2403190</resetValue>
          <fields>
            <field>
              <name>SPI_DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
